In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [3]:
df = pd.read_csv('stud.csv')
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
#check the missing values in the datasets
df.isnull().sum()

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

In [6]:
#Check the duplicates in the datasets
df.duplicated().sum()

np.int64(0)

In [ ]:
#Check the statistics of the datasets
df.describe()

       math_score  reading_score  writing_score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [ ]:
#check the datatypes in each atasets
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race_ethnicity               1000 non-null   object
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [11]:
#categories the numerical and categorical feature in the following datasets

numerical_features = [feature for feature in df.columns if df[feature].dtype !='O']
print('we have {} numerical features : {}'.format(len(numerical_features),numerical_features))

categorical_features = [feature for feature in df.columns if df[feature].dtype =='O']
print('we have {} categorical features: {}'.format(len(categorical_features),categorical_features))

we have 3 numerical features : ['math_score', 'reading_score', 'writing_score']
we have 5 categorical features: ['gender', 'race_ethnicity', 'parental_level_of_education', 'lunch', 'test_preparation_course']

In [12]:
df.head(2)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88

In [13]:
df['Total_score'] = df['reading_score'] + df['writing_score'] + df['math_score']
df['Average'] = df['Total_score']/3

In [14]:
df.head(2)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,Total_score,Average
0,female,group B,bachelor's degree,standard,none,72,72,74,218,72.666667
1,female,group C,some college,standard,completed,69,90,88,247,82.333333

In [20]:
#Students who scored 100 marks in each categories like reading, writting, maths

reading_full_score = df[df['reading_score'] == 100]['reading_score'].count()
writing_full_score = df[df['writing_score'] == 100]['writing_score'].count()
math_full_score = df[df['math_score'] == 100]['math_score'].count()

print(f'Number of students with full marks in Maths: {math_full_score}')
print(f'Number of students with full marks in Writing: {writing_full_score}')
print(f'Number of students with full marks in Reading: {reading_full_score}')

Number of students with full marks in Maths: 7
Number of students with full marks in Writing: 14
Number of students with full marks in Reading: 17

In [21]:
reading_less_score = df[df['reading_score'] == 100]['reading_score'].count()
writing_less_score = df[df['writing_score'] == 100]['writing_score'].count()
math_less_score = df[df['math_score'] == 100]['math_score'].count()

print(f'Number of students with less marks in Maths: {math_less_score}')
print(f'Number of students with less marks in Writing: {writing_less_score}')
print(f'Number of students with less marks in Reading: {reading_less_score}')

Number of students with less marks in Maths: 7
Number of students with less marks in Writing: 14
Number of students with less marks in Reading: 17